export const curriculumData = {
  
  studentDevelopment: [
    {
      grade: '一年級',
      status: '情感中的意志',
      task: '整體',
      description: `
        <p>在第一個七年，孩子學習熟悉身體、發展空間的方向感和養成身體直立、說話和思考的基本發展能力。孩子所處的環境狀態就是他的學習情境。如：孩子所模仿的大人、所處的環境媒介作用等。模仿的作用足以把他所學的銘印在孩子的意志中。在幼稚園，經驗性的學習、玩、和同伴及老師們的密集社會接觸中的發現等等，構成幼兒教育的基調。經由非正式的遊戲和社會接觸，明瞭母語和數字的複雜性，但這些都還不是啟蒙教育。在第七年左右，是幼稚園到小學的銜接階段。此時期的孩子在身體的成長發育上進入最堅硬的部分－－換牙階段。他們在生長發育上已具足了足夠的生命力，因此開始跨越建構內在肉體的任務，轉而向外在世界開展。這是孩子開始學習認知的適當時機。在意識上，他們仍處於夢幻中，因此一年級的授課重點不在多，而是讓孩子透過遊戲、肢體活動、模仿，給孩子較寬闊、與其現階段生命相呼應的醒知；同時養成良好的班級生活習慣，培養對自然、生命、環境的尊重，以及對外在世界的興趣，這些都將成為未來人格發展很重要的學習過程。</p>
      `
    },
    {
      grade: '二年級',
      status: '情感中的意志',
      task: '二元',
      description: `
        <p>八歲的孩子繼續生活在一個巨大、自我創造的心理景象中。這種景象是孩子從內在的生命實體，發展個人思考圖像的天賦所得到的。與外在世界接觸的經驗會被孩子的想像所過濾，並依據孩子心中的原有圖像而重組。在這個年紀，孩子展現更大的警覺，去留意周圍所發生的事。整體的心境分化成一些顯著的對立。例如：對宗教元素有較深入較有意識的感覺，但卻伴隨著對淘氣的吸引力之覺醒。這個年紀的課程內容，讓孩子培養對呼吸的感覺，以及感受語言情感的豐富性。可理解地，孩子所熟悉的學習情境中，圖像思考仍居於很重要的地位。會移動、有生命之類的概念，最適合孩子做有意義的概念認識。經由大肢體動作和精細小動作，孩子繼續熟稔基礎的語文、數學。不管是跳躍、投接球、編織或吹笛子等，他們正在發展一些從一年級就開始學習的各種技巧和能力。因此，經由藝術的途徑，孩子的意識已經能夠被喚醒。在二年級的學童中，恆齒繼續長高，側面的臼齒和其它主要的牙齒都被堅固的安置。因此，特別的學習需求和困難是可預期的。在同一個班級內，學生的學習程度變得很不一樣，大部份自信心和班級的歸屬感必須靠一年級時所立下的根基。</p>
      `
    },
    {
      grade: '三年級',
      status: '情感中的意志',
      task: '入世',
      description: `
        <p>在三年級，學童進入生命中的第十年。這時期的孩子生理、心理、認知都產生很顯著的改變，這些變化被認為是第九年/第十年的門檻，早一點可能在8.5歲，晚一點在9.5歲開始會持續六個月到一年之久。這時期的孩子發展出明確而平衡的步伐、口腔中說話的聲音增大、發音也更直接清晰、孩子的身體架構也明顯更強了。心臟增大而能容納更多血液、呼吸與脈搏的比值也被確立：約是一次呼吸四次脈搏。生長發育開始比較集中在四肢與新陳代謝系統，身體軀幹的寬幅也大了。在一些孩子身上會看到顯著的發展面向，包括：厭倦、胃痛、頭痛、噁心、頭暈、食慾變化、哮喘、濕疹和混亂的睡眠模式等。史代納提到有關孩子情感生命的蛻變。三年級的孩子會經歷到在覺知世界時所呈現的以及他/她的情感中所顯現的二元對立性，這時候隨著孩子們的主觀性增長，孩子也同時經驗到更加有力的客觀感受，主觀的內在經驗和客觀世界實體在孩子的心靈中爭吵。問題、懷疑、孤獨和批評傾向的萌芽，逐漸凸顯在孩子心理景象中。無論發展快慢，對大部分的孩子而言，自我醒覺很重要的一步在這一年發生，從區別自己與周遭人物、分辨內在和外在世界，孩子經驗到醒覺。喪失以前與世界統整的失落感和以新眼光看待世界的訝異，這兩種對立的情緒使孩子感到混淆和不安。這些都將表現在孩子的氣質與性格行為上。在這個不確定的時期中，許多古老故事的創世圖像，它的律法和引導，撫慰了孩子內在的安全感。而農耕、建築等主課程則幫助他們適應環境和他們的新關係。</p>
      `
    },
    {
      grade: '四年級',
      status: '情感中的情感',
      task: '分裂',
      description: `
        <p>在生命的第十年，孩子完成發展中重要的一步。童年初期已告一段落，孩子漸漸從自我覺知的角度來看待世界，此時教師的權威也會面臨質疑和考驗。然而，華德福教育三年級的課程設計便是為了陪伴孩子經歷這個階段為目標，四年級則是更確認、被鼓舞地完成這一階段。回顧三年級的課程，我們帶領孩子初生的自我以真實的身體意志透過農耕與建築進入外在世界，也從創世故事預備孩子經驗了神話進入歷史的轉折，所有主課程科目背後都是為了要讓孩子遇見文明世界的歷程，正如我們人類意識發展的過程。四年級的孩子開始進入「童年的心臟」，此時，孩子們的內在自我動力帶領著他們去連結呼吸與血液循環和諧的關係，這個新狀態的自信表現在整個人充滿活力與對世界的好奇及學習興致上。在十到十一歲（九到十足歲）的這段時間，也正值生命第二個七年與「導師時期」的中間點，這時的他們已完全從幼兒期轉換準備進入下一階段，但到青春期的轉變則尚未開始。為了呼應學生的活力，在課程整體節奏的安排上，就必須引導他們進入教室裡充沛能量的學習環境。孩子需要接受挑戰，並且擴張他們獨立工作的可能性，「工作、工作，做很多工作」是四年級最好的座右銘。學習上進入另一個開始，而這也是自然科學的開端：從外觀型態的觀察開始做現象研究。研究人類行為與動物王國的關係及對在地環境深入認識，並學習繪製鳥瞰地圖的能力。這一年老師和孩子們相處的目標是去遇見孩子對具體知識領域的興趣，並經由想像力呈現課程也提供孩子們更獨立的工作機會，從中找到自己與學習內容、自己與同伴、自己與老師的新關係。主課程的故事增加了許多複雜的人性矛盾、掙扎的情節，甚至也體現了各式各樣人的樣貌，呼應孩子們此階段更明確的氣質分化與小團體的人際互動模式（例如：西遊記中每個主角的性格在面對同一情境不同的處理方式、北歐神話中人物的多樣性與具象的刻畫黑暗與邪惡），從這些故事中，讓孩子們感受什麼是「個別的惡」而什麼是「整體的善」，孩子們也必須從中建立他們對生態環境、社會環境和地理環境的感覺！</p>
      `
    },
    {
      grade: '五年級',
      status: '情感中的情感',
      task: '和諧',
      description: `
        <p>五年級的孩子發展出「我」和「世界」的不同，他們個別的「意志」元素也開始增長，對自我的醒覺開始強化，也開始社會化；雖然各自的「自我」羽翼初成，但一個有力量的團體動力會在班上浮現。在認知上，孩子更能夠以一個真實而合理的態度，去了解各種問題和現象。雖然，概念的理解和形塑，開始比較不依賴各自的影像與思考圖像，而比較依靠理解清楚、實際事務、非感官概念等能力的發展；但是，思考過程的圖像性元素仍在孩子的意識中佔有很重要的地位。孩子在這一年可以更有意識地運用其智識能力，他們往往帶來一個新的超然想法，並伴隨著評判性的觀點。五年級孩子的年紀是一個心花盛開的時期。孩子經驗到身高的增長，在其團體內持續進行肢體的操練。音樂上，孩子開始有能力精通一項樂器。在算數的基本技巧上，語文強的學童基於對數理基本的規則、過程及結構的自信而展現出獨立的創造性。在智識與道德上，孩子已準備好迎接新的挑戰；從這個年紀開始，掌握到個人責任的基本概念與從「合理」的角度去了解「是非」的能力。不過以上所言的美好，在五年級結束，進到六年級時，孩子會再次經驗和發現到和諧的喪失。而這就是五年級孩子整體的內在發展與意識進化狀態。</p>
      `
    },
    {
      grade: '六年級',
      status: '情感中的情感',
      task: '規矩',
      description: `
        <p>因為青春期的叩門，身體又要啟動再一波的變動，此時期的孩子，開始出現進入前青春期的特徵，孩子的成長開始表現在骨架上，孩子的手腳開始拉長，四肢明顯增長，並有一些笨拙、不靈活的動作傾向。此時因為肌肉與骨架的發展變動，使得身體原本習慣的重心位 置逐漸位移，使得孩子進一個不自在的適應過程，常會覺得行立坐臥都不對勁。十二歲大的身體從骨架上經驗重力的強度，生理上的變化伴隨著孩子首次經驗到思想上的因果關係；然而心理上，孩子進入一個特稱為「被調包的醜嬰孩」時期，此時身體外觀的急劇變化讓他們親眼見證自己童年的逝去並面對個體誕生的劇痛。而由於他們新的思考能力浮現，孩子可被引導瞭解他們在世界上工作的因果關係。孩子的醒覺須被導向他們將像成人一般生活、工作的世界。孩子在學校的工作需要受到挑戰並能夠接受高標準的要求。此時期的孩子，在內在意識發展上，從五年級的希臘時代之和諧，到六年級開始進入羅馬時代的特徵，需要如羅馬時代強而有力的法律、領導力與秩序感。欲帶領這個年紀的孩子之教師，必須擁有如同統治羅馬士兵的君主之權威，否則極可能成為羅馬士兵手下的俘虜。老師的目標是和孩子朝著外在世界的走向一起工作。孩子初顯的批判能力必須被導向 以科學的觀點去觀察自然世界，而他們對社會關係的興趣漸增，也要給他們一些機會對班級社群負責。這些課題的目的是塑造同學間以及他們和老師之間的新關係。</p>
      `
    },
    {
      grade: '七年級',
      status: '情感中的思考',
      task: '探索',
      description: `
        <p>孩子到了13歲時，成為所謂的青少年(teenager)，通常有著兩股力量的作用：一為「對世上現象及相關知識的渴求」，二則為「初萌發的自我反思能力」。孩子身體上的成長絕對快於心理上變化，因而帶來了性別的認同與壓力，且也許會帶來一些孤獨的個人經驗，致使孩子處於焦慮與敏感的情緒當中。同時，內在湧出的對於世界探索的渴望，會與這樣的情緒產生了矛盾或抗衡，也會讓男孩與女孩在這時面對的挑戰明顯不同。因此，課程的焦點會置於孩子對外在世界的探索與內在的旅程。我們將提供青少年許多新觀點，讓他們的關注力導向整個世界。教師將逐漸鼓勵孩子做出自己的判斷，引導他們在社群中負起社會責任；同時，體驗到自己是世界公民的一份子，也是負有社會責任的個體。</p>
      `
    },
    {
      grade: '八年級',
      status: '情感中的思考',
      task: '革命',
      description: `
        <p>14歲的孩子，身體與心理都持續地變化，世界與國際觀逐漸走入孩子心中，觀念世界的一切對於此時的孩子產生意義。14歲的時的身體機能也漸趨明顯，對於原先以接受的規定、結構會開始仔細地反覆檢查，甚至嘗試挑戰之。要如何陪伴孩子度過個體化的階段？要如何不壓抑卻也不被情緒淹沒地陪伴孩子經歷？如何陪伴孩子經歷內在意志、情感與思考的誕生、解放、開啟？──這些皆是家長與教師在此時的巨大挑戰。在這個階段的孩子，可以思考過去，也可以感知未來，並進入自己的節奏性之中。在這個年級的最後階段，孩子將會取得全新的角色模範，並找到全新的權威來源。同儕的影響力在此時將大大增加，孩子自己會嘗試與同齡者逐漸趨同。我們必須延伸孩子對全人類、全世界的連結意識與責任，同時讓孩子將經驗轉化成自己的原創性思考。因此，八年級時，我們將要求孩子選擇一個對於自己有特殊意義的主題，讓孩子學習長時間地獨立工作，整合過去所學，再於期末時當眾發表，此即八年級的階段任務：個人專題報告。</p>
      `
    },
    {
      grade: '九年級',
      status: '情感中的思考',
      task: '蟄伏',
      description: `
        <p>九年級的孩子會以激烈的方式追求獨立，他們將不斷地遠離那個過往熟悉、安全、確定的世界，以及他們曾經習得的一切。孩子需要重新學習一切關於行走、說話與思考的事物，以保持內在的平衡。另一方面，孩子的生命終將有巨大意志力預備爆發，這個階段孩子的思考能力與邏輯能力急速覺醒，使他們必須讓自我與他人保持距離。他們會熱切地尋求知性、熱情與慾望之間的平衡。九年級的孩子會尋求並期待大人給予的清楚解釋、感同身受、理解與安慰，以及大人們更為開放的態度與幽默感，以積累足夠的能量醞釀出面對生命中遭遇的衝突或困難。由於此時期的知性與理性的深度更為深化，將安排更多專業教師負責個專業科目的教學，深入不同領域並開展孩子專長。由於學科難度皆會加深，各類的活動也會變得更繁多，孩子應開始學習配置自己的時間運用，並決定多樣活動的優先順序。我們期望透過學校的課程，讓孩子找到自我生命的熱情，找到自己的天命，肯定與尊重自己。在這個前提下，我們會帶領孩子增加與社會的互動，進行公益服務。</p>
      `
    }
  ],
  curriculumSpirit: `
    <h3>課程精神內涵</h3>
    <ul>
        <li><b>呼應孩子成長階段需求:</b> 7-15歲階段，孩子的乙太生命力正在形塑。韻律、規律的呼與吸、重複的穩定性，都是課程裡重要的元素。面對國中小的不同階段，課程中意志、情感、思考的比重與次第也細微地調整。課程中鼓勵孩子發展四肢，以意志力及創造性活動積極入世。課程將以整體的角度入手，對應孩子當下意識的開展及學習基礎。</li>
        <li><b>支持當代人類意識發展:</b> 意志力是人類進化可能的胚芽。當代人類面對到思考、理智與情感交織的總總分岔點。創造真實的情威基 礎與經驗，學習著客觀觀察，保持存有之心，這是人類意識發展重要的關卡。跨越9歲危機後的自然課程樣貌，協助孩子明白，人類將是透過四肢來創造與服務的神聖生命。在語言學習、在社會互動裡，我是如此的獨—無二，而我同時也是與外在所有的生命形式、人群及這個地球及星系宇宙相依相存。人類的呼吸相應著 宇宙運行的韻律。我的意識轉化，也和無邊的意識整合同步。</li>
        <li><b>參與在地社群生活樣貌:</b> 同心的地方探索以目前校地所在文山區作為核心擴展，<a href="https://zh.wikipedia.org/wiki/%E6%99%AF%E7%BE%8E" target="_blank">景美</a>位於文山區西北部，<a href="https://zh.wikipedia.org/wiki/%E6%9C%A8%E6%9F%B5" target="_blank">木柵</a>位於文山區東南部，與<a href="https://zh.wikipedia.org/wiki/%E6%96%B0%E5%BA%97" target="_blank">新店</a>區形成三角的地理區，在新店溪與景美溪的歷史地貌裡，珍貴的人文地貌，也有各行各業課程的探索對象。往河邊走去，鄰近的仙跡岩，也是孩子接觸小山、樹木的空間，甚至延伸至深坑區老街。近來，親師也嘗試循著地方文史工作者的腳步，嘗試走讀文山區，發掘在地社群的生活樣貌與需求。</li>
        <li><b>實踐具體藝術行動連結:</b> 藝術行動是全感官的投入，孩子們在繪畫、塑形（蜜蠟、泥塑）的課程裡，感受真實圖像、感知自己。孩子們在音樂、詩歌性的課程裡，分享內在的情感與展現律動，並藉此作為社會參與的活動。藝術行動的課程安排，除了是一天內重要的自我喚醒外，也時常扮演滋養的呼出，統合一天的吸收。藝術行動是親師生彼此感知生活節令、脈動的窗口，也是學習歷程裡，經驗美、經驗客觀、經驗直覺性、經驗活生生的創造、經驗重複有意義的練習的重要安排。</li>
    </ul>
  `
};