export const curriculumTableData = [
  {
    learningArea: '外語(英語)',
    subItems: [
      {
        subItemName: '字彙',
        grades: {
          '一年級': ['colors', 'parts of the body', 'number 1-20', 'weather', 'days of week/month', 'seasons', 'shapes', 'opposites', 'movements', 'animals', 'Things from nature'],
          '二年級': ['cardinal (1-100)', 'ordinal numbers (1-10)', 'Months and students\' birthday', 'Things from nature', 'Activity of daily routines', 'Objects in the classroom', 'Weather', 'Animals'],
          '三年級': ['body parts', 'movements', 'colors', 'shapes', 'weather', 'time/week/month', 'animals', 'food', 'clothing', 'furniture', 'transport/places', 'directions', 'prepositions'],
          '四年級': ['主題單字 (verbs, nouns, adjectives, adverb, prepositions)', '常見字 (Dolch sight words)'],
          '五年級': ['300~600單字'],
          '六年級': ['300~600單字'],
          '七年級': ['1000~1200單字'],
          '八年級': ['1000~1200單字'],
          '九年級': ['1200~1400單字']
        }
      },
      {
        subItemName: '句型/文法',
        grades: {
          '一年級': ['Imperative sentences', '祈使句'],
          '二年級': ['Wh-questions (what/ when/ where/ how)', 'Be verb-questions to be and to do in the sentence form'],
          '三年級': ['5W1H問答 (what, where, when,who, how)', '代名詞 (人稱 I you we)', '所有格 my your our', '地方介系詞'],
          '四年級': ['時態基本概念', '動詞三態(單純念誦)', '單複數文法', '代名詞 (人稱/ 所有格/ 性別)'],
          '五年級': ['詞性介紹 (動詞/名詞/形容詞/副詞)', '直述句', '否定句', '疑問句'],
          '六年級': ['簡單式', '進行式', '未來式', '動詞三態(記憶)'],
          '七年級': ['現在式→過去式', '動詞三態(運用)'],
          '八年級': ['過去進行式/完成式', '動詞三態(運用)', '直接語句', '間接語句'],
          '九年級': ['假設語氣']
        }
      },
      {
        subItemName: '聽說',
        grades: {
          '一年級': ['英語詩歌', 'Basic questions', 'Simple command', 'Simple stories'],
          '二年級': ['英語詩歌', 'Simple stories and act out', 'Respond to questions about themselves'],
          '三年級': ['英語詩歌', 'Stories and act out (individually )', '基礎問候與不同回應', '教室用語'],
          '四年級': ['英語詩歌', '教室用語', '故事回溯'],
          '五年級': ['基本句型口語運用', '讀本朗讀', '對話練習'],
          '六年級': ['日常問答', '故事問答與重述', '讀本朗讀'],
          '七年級': ['描述自我、他人以及環境 並進行問答'],
          '八年級': ['事件、情境與感受的描述 與問答'],
          '九年級': ['依不同主題以英語進行 討論']
        }
      },
      {
        subItemName: '讀寫',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['字母大小寫', '自然發音', 'CVC Word'],
          '四年級': ['常見字(sight words)', '雙母音/三子音/拼字練習', '書寫一至三年級的詩歌', '故事朗讀書寫', '簡單句子朗讀與書寫'],
          '五年級': ['讀本(ex.Happy Jack )', '草寫練習', '故事問答書寫'],
          '六年級': ['讀本閱讀', '抄寫', '簡單寫作', '詩歌背誦'],
          '七年級': ['讀本/不同類型短文閱讀', '抄寫', '詩歌背誦'],
          '八年級': ['讀本/文章並摘要', '書寫簡訊與書信', '詩歌默寫'],
          '九年級': ['閱讀報導/傳記', '主題性短文/詩歌書寫']
        }
      },
      {
        subItemName: '綜合能力活動',
        grades: {
          '一年級': ['理解教師指令與遊戲規則', '手指搖'],
          '二年級': ['理解教師指令與故事內容'],
          '三年級': ['聆聽故事並能夠理解大意(字母/不同主題)', '運用練習過的句子'],
          '四年級': ['英文小書'],
          '五年級': ['英語朗讀會'],
          '六年級': ['英語音樂劇'],
          '七年級': ['英語戲劇'],
          '八年級': ['英語演講會'],
          '九年級': ['國際文化博覽會']
        }
      }
    ]
  },
  {
    learningArea: '本國語',
    subItems: [
      {
        subItemName: '主課程',
        grades: {
          '一年級': ['童話故事'],
          '二年級': ['寓言故事', '聖者故事'],
          '三年級': ['舊約聖經', '原住民族創世神話故事', '中國創世神話'],
          '四年級': ['西遊記', '北歐神話'],
          '五年級': ['古文明傳說：', '印度、波斯、巴比倫、', '埃及、希臘'],
          '六年級': ['藉由文史主課練習文字組織能力、內省再敘述的能力'],
          '七年級': ['藉由文史主課練習文字組織能力、內省再敘述的能力、抽象思考能力'],
          '八年級': ['文法與修辭'],
          '九年級': ['現代文學/ 台灣文學 選篇']
        }
      },
      {
        subItemName: '閱讀與寫作/語文練習',
        grades: {
          '一年級': ['-'],
          '二年級': ['注音符號'],
          '三年級': ['字典使用', '搭配主課程之閱讀延伸與寫作練習'],
          '四年級': ['搭配主課程之閱讀延伸與寫作練習'],
          '五年級': ['搭配主課程之閱讀延伸與寫作練習'],
          '六年級': ['搭配主課程之閱讀延伸與寫作練習'],
          '七年級': ['古典詩詞（詩經、樂府、詩）', '史記', '文言文小說', '青少年探索文學'],
          '八年級': ['古典文言散文選篇', '傳記選篇', '青少年成長文學'],
          '九年級': ['現代長篇小說', '農場故事選篇(鄉土文學)', '自傳書寫']
        }
      }
    ]
  },
  {
    learningArea: '數學',
    subItems: [
      {
        subItemName: '主課程',
        grades: {
          '一年級': ['認識數字', '認識四則運算概念(20以內)', '基數與序數'],
          '二年級': ['四則運算練習', '十二乘法表', '位值表'],
          '三年級': ['加減乘法直式算則', '測量：長度、重量、容量、時間', '貨幣'],
          '四年級': ['因數與倍數', '分數', '數字家族：完美數、不足數、豐富數、質數', '除法直式算則'],
          '五年級': ['分數四則運算', '小數', '徒手幾何'],
          '六年級': ['尺規幾何', '生活應用數學', '簡單代數', '比與比值'],
          '七年級': ['負數與未知數', '自然中的幾何(黃金比例、畢氏定理)'],
          '八年級': ['柏拉圖正多面體', '圓錐曲線', '一元二次方程式'],
          '九年級': ['排列組合', '機率統計', '圓與三角形性質證明']
        }
      },
      {
        subItemName: '練習',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['搭配主課程延伸練習'],
          '四年級': ['搭配主課程延伸練習'],
          '五年級': ['搭配主課程延伸練習'],
          '六年級': ['搭配主課程延伸練習', '單位轉換應用練習', '面積、角度'],
          '七年級': ['最大公因數', '最小公倍數', '指數、科學記號', '正比、反比、連比', '數列', '一元一次方程式', '二元一次方程式', '平面上的幾何（點線面、三角形性質）'],
          '八年級': ['平面上的幾何（多邊形性質）', '二元一次聯立方程式', '直角座標平面', '柱體與錐體', '平方根運算'],
          '九年級': ['一元一次不等式', '一元二次方程式運算', '二次函數', '應用問題']
        }
      }
    ]
  },
  {
    learningArea: '自然',
    subItems: [
      {
        subItemName: '主課程',
        grades: {
          '一年級': ['自然故事(短篇)'],
          '二年級': ['自然故事(長篇)'],
          '三年級': ['農耕故事與實作'],
          '四年級': ['人與動物的關係'],
          '五年級': ['人與植物的關係'],
          '六年級': ['物理：聲光熱', '地科：岩石與礦物', '天文學'],
          '七年級': ['生物：生理學', '物理：聲光熱電與磁', '簡單機械', '化學：燃燒'],
          '八年級': ['生物：人體結構學', '物理：流體力學', '力與電磁', '化學：營養學'],
          '九年級': ['生物：感官生理', '物理：運輸與通訊', '化學：有機化學']
        }
      },
      {
        subItemName: '養生 農耕/園藝',
        grades: {
          '一年級': ['衛生習慣養成', '認識季節食材', '盆栽種植', '外出散步'],
          '二年級': ['從種子到餐桌', '花園照顧', '外出散步'],
          '三年級': ['農耕實作'],
          '四年級': ['田園日常照顧'],
          '五年級': ['田園日常照顧'],
          '六年級': ['田園日常照顧'],
          '七年級': ['校園景觀營造', '生態觀察與經營', '校園植物地圖'],
          '八年級': ['校園植物種植規劃與設計', 'BD配方培養與預備', '生態學概念'],
          '九年級': ['植物學', '不同有機農法認識', '農場實習']
        }
      },
      {
        subItemName: '練習',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['-'],
          '四年級': ['-'],
          '五年級': ['-'],
          '六年級': ['-'],
          '七年級': ['分類學', '生物鏈', '比熱', '波的性質'],
          '八年級': ['動物行為', '生命恆定性', '濃度計算', 'pH值計算'],
          '九年級': ['神經系統', '內分泌', '化學實驗', '地震']
        }
      }
    ]
  },
  {
    learningArea: '社會',
    subItems: [
      {
        subItemName: '歷史',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['建築的演變', '建築實作'],
          '四年級': ['地方探究', '各行各業的認識'],
          '五年級': ['臺灣歷史：史前~明鄭', '西方史：希臘', '東方史：周朝~春秋'],
          '六年級': ['東方史：戰國~三國', '西方史：羅馬建立~帝國沒落'],
          '七年級': ['東方史：魏晉-明', '西方史：中世紀', '大航海', '文藝復興'],
          '八年級': ['東方史：東方近代史', '西方史：西方近代史'],
          '九年級': ['兩次世界大戰', '美蘇冷戰', '1945後台灣現代史', '當代史']
        }
      },
      {
        subItemName: '地理',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['-'],
          '四年級': ['-'],
          '五年級': ['臺灣地理'],
          '六年級': ['亞洲地理'],
          '七年級': ['區域地理（歐洲、美洲）', '天氣與地形'],
          '八年級': ['區域地理（非洲、大洋洲）', '氣候類型', '基本地理知識（時區、經緯度、人口、都市）'],
          '九年級': ['地質學']
        }
      },
      {
        subItemName: '公民',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['-'],
          '四年級': ['-'],
          '五年級': ['-'],
          '六年級': ['-'],
          '七年級': ['融合班級營造（主題：自由與民主）'],
          '八年級': ['融合班級營級（主題：政府與法律）'],
          '九年級': ['融合班級營造（主題：經濟與多元文化）']
        }
      },
      {
        subItemName: '社會練習',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['-'],
          '四年級': ['-'],
          '五年級': ['-'],
          '六年級': ['-'],
          '七年級': ['-'],
          '八年級': ['-'],
          '九年級': ['公民課程綜整', '哲學概論']
        }
      }
    ]
  },
  {
    learningArea: '平面藝術',
    subItems: [
      {
        subItemName: '形線畫',
        grades: {
          '一年級': ['直線和曲線', '封閉圖形', '連續圖形'],
          '二年級': ['連續圖形', '對稱圖形'],
          '三年級': ['簡單幾何圖形', '形變', '過中線'],
          '四年級': ['跨越圖形(融入練習課)'],
          '五年級': ['-'],
          '六年級': ['-'],
          '七年級': ['-'],
          '八年級': ['-'],
          '九年級': ['-']
        }
      },
      {
        subItemName: '繪畫',
        grades: {
          '一年級': ['濕水彩'],
          '二年級': ['濕水彩'],
          '三年級': ['濕水彩', '蠟磚蠟筆'],
          '四年級': ['濕水彩', '色鉛筆'],
          '五年級': ['濕水彩', '色鉛筆', '乾水彩', '粉彩'],
          '六年級': ['粉彩', '炭筆'],
          '七年級': ['光影觀察', '色度變化練習(鉛筆素描)'],
          '八年級': ['面紗畫', '透視畫', '炭筆'],
          '九年級': ['版畫', '水墨', '人物速寫']
        }
      },
      {
        subItemName: '書法',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['甲骨文'],
          '四年級': ['甲骨文', '金文', '小篆'],
          '五年級': ['大篆', '小篆'],
          '六年級': ['隸書', '簡帛'],
          '七年級': ['魏碑'],
          '八年級': ['行書'],
          '九年級': ['大字體']
        }
      }
    ]
  },
  {
    learningArea: '立體藝術',
    subItems: [
      {
        subItemName: '塑形',
        grades: {
          '一年級': ['蜜蠟塑形', '圓形、蛋形', '簡單幾何形', '植物、動物'],
          '二年級': ['蜜蠟塑形', '搭配主課程題材'],
          '三年級': ['-'],
          '四年級': ['泥塑', '原型', '動物', '簡單人型', '配合主課程（廟）'],
          '五年級': ['泥塑', '植物', '奧林匹克運動姿態', '配合主課程（神殿和神）'],
          '六年級': ['泥塑', '基礎立體幾何', '器皿設計', '配合主課程（兵馬俑）'],
          '七年級': ['泥塑', '大型器皿（土條）', '配合主課程（母與子、人與馬）'],
          '八年級': ['泥塑', '柏拉圖多面體', '配合主課程（頭骨）'],
          '九年級': ['泥塑', '臉部', '浮雕']
        }
      },
      {
        subItemName: '手工',
        grades: {
          '一年級': ['捲毛線球', '手指編', '棒針'],
          '二年級': ['棒針'],
          '三年級': ['鉤針'],
          '四年級': ['刺繡', '手縫', '編繩'],
          '五年級': ['十字繡', '進階棒針'],
          '六年級': ['手縫與打版'],
          '七年級': ['皮革製品創作', '繩結編織'],
          '八年級': ['縫紉機使用'],
          '九年級': ['拷克機使用']
        }
      },
      {
        subItemName: '木工',
        grades: {
          '一年級': ['-'],
          '二年級': ['-'],
          '三年級': ['-'],
          '四年級': ['-'],
          '五年級': ['認識手工具', '木槌製作', '塗裝體驗'],
          '六年級': ['實用餐具製作', '木砧板雕刻', '魔杖雕刻'],
          '七年級': ['登山杖雕刻'],
          '八年級': ['輕型電動工具使用', '木質兵器製作'],
          '九年級': ['中型電動工具使用', '拚木小物', '自由創作']
        }
      }
    ]
  },
  {
    learningArea: '音樂/合奏',
    subItems: [
      {
        subItemName: '',
        grades: {
          '一年級': ['齊唱', '五音笛吹奏'],
          '二年級': ['齊唱', '五音笛吹奏'],
          '三年級': ['輪唱', '七音笛吹奏', '弦樂器'],
          '四年級': ['分部合唱', '合奏', '七音笛吹奏', '音階', '視譜', '弦樂器'],
          '五年級': ['分部合唱', '合奏', '大調、小調音階', '選擇性個人樂器', '室內樂', '歌曲創作'],
          '六年級': ['分部合唱、合奏', '大調、小調音階', '室內樂', '歌曲創作'],
          '七年級': ['音樂史（中世紀、文藝復興）', '音樂元素（節奏、拍號）', '樂團合奏', '中音直笛吹奏'],
          '八年級': ['音樂賞析（古典時期）', '音樂元素（音程、音階）', '樂團合奏', '中音直笛SATB聲部吹奏'],
          '九年級': ['音樂賞析（浪漫時期、現代）', '音樂元素（和聲、調性）', '樂團合奏', '中音直笛SATB聲部吹奏']
        }
      }
    ]
  },
  {
    learningArea: '肢體表演藝術',
    subItems: [
      {
        subItemName: '遊戲/體育/自然日',
        grades: {
          '一年級': ['自然散步', '大地遊戲'],
          '二年級': ['自然散步', '大地遊戲', '健行登山'],
          '三年級': ['團體遊戲', '登山健行', '游泳'],
          '四年級': ['登山健行', '團體遊戲', '肢體遊戲', '游泳'],
          '五年級': ['奧林匹克五項運動', '社交與個人遊戲', '游泳', '雜耍'],
          '六年級': ['簡易障礙賽', '游泳', '球類運動', '雜耍'],
          '七年級': ['球類運動', '游泳', '體能訓練'],
          '八年級': ['團體運動', '重量訓練', '有氧運動', '游泳', '球類運動'],
          '九年級': ['長跑', '球類運動', '射箭']
        }
      },
      {
        subItemName: '優律思美',
        grades: {
          '一年級': ['進場、圍圈', '模仿動作、結束詩靜默等習慣養成', '直線和曲線的空間移動', '開頭詩學習母音和子音的原型', '五聲音階發展', '不同節奏步伐'],
          '二年級': ['五聲音階發展', '不同節奏步伐', '強調寓言和動物特性的節奏活動'],
          '三年級': ['領隊進場', '直線和曲線的空間移動（大8）', '有關創世紀詩', '模仿母音和子音姿勢練習'],
          '四年級': ['幾何空間形移動（圓變四列, 五角星）', '子音姿勢學習並演示自己名字'],
          '五年級': ['幾何空間形移動（五瓣花）', '用母音和子音演示詩詞'],
          '六年級': ['幾何空間形移動（三角形位移）', '銅棒的練習'],
          '七年級': ['武術'],
          '八年級': ['武術'],
          '九年級': ['武術']
        }
      },
      {
        subItemName: '戲劇',
        grades: {
          '一年級': ['融入主課程進行'],
          '二年級': ['融入主課程進行'],
          '三年級': ['融入主課程進行'],
          '四年級': ['融入主課程進行'],
          '五年級': ['融入主課程進行'],
          '六年級': ['融入主課程進行'],
          '七年級': ['戲劇遊戲', '戲劇與課程（中世紀主題等）', '口說的練習'],
          '八年級': ['戲劇遊戲', '戲劇與課程（人物傳記主題等）', '後台協力（音樂、燈光、道具等）'],
          '九年級': ['戲劇遊戲', '戲劇與課程（喜悲劇主題等）', '戲劇公演製作']
        }
      }
    ]
  }
];