export const newsData = [
  {
    title: '🚩🚩🚩 家長接送臨停特別注意事項（重要置頂）',
    content: `
      <p>近一年來由於1999、教育局和實驗教育中心一直不斷接獲學校周邊民眾投訴，表示上放學期間家長汽車違停在試院路上等待接送孩子的問題，「已嚴重影響用路人視線造成民眾困擾」。</p>
      <p>同心教師團在此向各位家長呼籲，木柵路一段屬臺北市主要幹道之一，車流量不分時段皆大；試院路（雙號）在校園側路幅較窄，加上上放學時間與世新大學學生上下課時段重疊，車流量亦不小，因此：</p>
      <ol>
          <li>校門口前木柵路一段已劃設紅線，禁止停車；該處也是交通警察執法取締臨停之重點。</li>
          <li>試院路（雙號）在校園側設有「二處」黃線區，「原則上」可臨停讓孩子上下車，但不得佔用超過3分鐘。</li>
          <li>若該二處黃線區皆停有車輛，請務必繼續向世新大學方向開去，巷內路幅較寬，二側設有收費停車格可暫停（9:00前免費）；此外，校園附近還有木柵路一段76巷路旁腹地、191巷旁收費停車處，以及和興路84巷收費停車格等處，皆可臨停。</li>
          <li>國家考場地下停車場有30分鐘內停車免收費措施，歡迎多加利用。</li>
      </ol>
    `
  },
  {
    title: '人才招募',
    content: `
        <p><b>最新甄選資訊如下：</b></p>
        <p><b>臺北市同心華德福實驗教育機構教師甄選</b></p>
        <p><b>同心華德福實驗教育機構 徵【中學理科教師】</b></p>
        <p>𖡼𖡼𖡼用實驗與想像，點燃孩子對自然與宇宙的好奇𖡼𖡼𖡼</p>
        <p>在華德福教育裡，理科不只是公式與定律，而是理解世界的橋樑。</p>
        <ul>
            <li>擅長教授基礎自然、物理、化學或生物概念</li>
            <li>能設計實驗、觀察與生活連結的教學</li>
            <li>願從故事、觀察與探究出發，啟發孩子的思辨與驚奇</li>
            <li>有中學教學經驗或理工背景尤佳</li>
        </ul>
        <p>我們提供的不只是工作，而是一段深具意義的教育旅程：</p>
        <ul>
            <li>華德福教育師資訓練與進修機會</li>
            <li>溫暖團隊、支持性校園氛圍</li>
            <li>自然共處、充滿節奏感的教育現場</li>
        </ul>
        <p><b>投遞方式</b></p>
        <ul>
            <li>請將履歷＋理念簡述寄至：tx@tongxin-waldorf.org</li>
            <li>主旨註明：「應徵理科教師－您的姓名」</li>
            <li>聯絡方式：02-2236-6791 (教務-廖老師)</li>
        </ul>
    `
  }
];