export const timetableData = [
  {
    "grade": "四年級山嵐班",
    "schedule": [
      { "time": "08:10~08:20", "duration": "10", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:20~10:20", "duration": "90", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:20~10:50", "duration": "30", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["體育（趙奕瑋）", "優律思美（林育姍）", "自然日（呂孟庭）", "秋冬:練習(呂孟庭)<br>春夏:書法(朱道興)", "英文（高嘉淇）"] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["合奏（敏捷吾）", "英文（高嘉淇）", "自然日（呂孟庭）", "音樂（李軒）", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["練習（呂孟庭）", "手工（楊慧如）", "結束圈(14:00放學)", "秋冬:繪畫(林孟廷)<br>春夏:練習(呂孟庭)", "泥塑（張又予）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["英文（高嘉淇）", "手工（楊慧如）", "泥塑（張又予）", "", ""] },
      { "time": "15:10~15:30", "duration": "20", "sessions": ["整潔活動", "整潔活動", "整潔活動", "整潔活動", ""] },
      { "time": "15:30~15:40", "duration": "10", "sessions": ["結束圈", "結束圈", "結束圈", "結束圈", ""] },
    ]
  },
  {
    "grade": "五年級日初班",
    "schedule": [
      { "time": "08:10~08:20", "duration": "20", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:20~10:20", "duration": "120", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:20~10:50", "duration": "20", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["英文（高嘉淇）", "手工（楊慧如）", "自然日（周天禧）", "秋冬:書法(朱道興)<br>春夏:繪畫(林祐竹)", "語文練習（周天禧）"] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["體育（趙奕瑋）", "手工（楊慧如）", "自然日（周天禧）", "閱讀與寫作（周天禧）", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["數學練習（高縈婕）", "優律思美（林育姍）", "結束圈(14:00放學)", "秋冬:泥塑(張又予)<br>春夏:木工(林孟廷)", "英文（高嘉淇）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["合奏（靖宇乃涵霈）", "英文（高嘉淇）", "音樂（陳宇璿）", "", ""] },
      { "time": "15:10~15:30", "duration": "20", "sessions": ["整潔活動", "整潔活動", "整潔活動", "整潔活動", ""] },
      { "time": "15:30~15:40", "duration": "10", "sessions": ["結束圈", "結束圈", "結束圈", "結束圈", ""] },
    ]
  },
  {
    "grade": "六年級浪花班",
    "schedule": [
      { "time": "08:10~08:20", "duration": "20", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:20~10:20", "duration": "120", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:20~10:50", "duration": "20", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["泥塑（江玄文）", "英文（高嘉淇）", "年段任務（游鈞桓）", "手工（楊慧如）", ""] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["泥塑（江玄文）", "優律思美（林育姍）", "年段任務（游鈞桓）", "手工（楊慧如）", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["合奏(靖宇乃涵霈）", "秋冬:數學練習（游鈞桓）<br>春夏:木工(吳庭豪)", "結束圈(14:00放學)", "英文（高嘉淇）", "音樂（陳宇璿）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["體育（趙奕瑋）", "閱讀與寫作（黃千瑜）", "英文（高嘉淇）", "", ""] },
      { "time": "15:10~15:30", "duration": "20", "sessions": ["整潔活動", "整潔活動", "整潔活動", "整潔活動", ""] },
      { "time": "15:30~15:40", "duration": "10", "sessions": ["結束圈", "結束圈", "結束圈", "結束圈", ""] },
      { "time": "", "duration": "", "sessions": ["秋冬:繪畫(林祐竹)<br>春夏:數學練習（游鈞桓）", "秋冬:繪畫(林祐竹)<br>春夏:語文練習（游鈞桓）", "秋冬:語文練習（游鈞桓）<br>春夏:木工(吳庭豪)", "", ""] },
    ]
  },
  {
    "grade": "七年級大地班",
    "schedule": [
      { "time": "08:10~08:30", "duration": "20", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:30~10:30", "duration": "120", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:30~10:50", "duration": "20", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["音樂（陳乃欣）", "木工（吳庭豪）", "年段任務(姜怡伶)", "秋冬:藝術(張又予)<br>春夏:泥塑（張又予）", "閱讀與寫作（連涓妏）"] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["合奏（陳乃欣）", "年段任務(姜怡伶)", "數學練習（游鈞桓）", "", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["秋冬:手工（楊慧如）<br>春夏:戲劇（董佳琳）", "武術（趙奕瑋）", "班會(姜怡伶)", "書法(朱道興)", "自然練習（劉得光）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["英文（May）", "社團", "英文（May）", "體育(林孟廷）", ""] },
      { "time": "15:20~16:05", "duration": "45", "sessions": ["數學練習（姜怡伶）", "英文（May）", "英文（May）", "園藝（林孟廷）", ""] },
    ]
  },
  {
    "grade": "八年級松果班",
    "schedule": [
      { "time": "08:10~08:30", "duration": "20", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:30~10:30", "duration": "120", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:30~10:50", "duration": "20", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["秋冬:手工（楊慧如）<br>春夏:戲劇（董佳琳）", "數學練習（姜怡伶）", "音樂（陳乃欣）", "英文（May）", "秋冬:木工（吳庭豪）<br>春夏:泥塑（張又予）"] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["武術（趙奕瑋）", "合奏（陳乃欣）", "英文（May）", "", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["英文（May）", "班會（連涓妏）", "語文練習（連涓妏）", "數學練習（游鈞桓）", "體育(林孟廷）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["英文（May）", "年段任務（連涓妏）", "社團", "秋冬:藝術(林祐竹)<br>春夏:書法（朱道興）", "自然練習（劉得光）"] },
      { "time": "15:20~16:05", "duration": "45", "sessions": ["園藝（林孟廷）", "年段任務（連涓妏）", "社會練習（連涓妏）", "", ""] },
    ]
  },
  {
    "grade": "九年級森林班",
    "schedule": [
      { "time": "08:10~08:30", "duration": "20", "sessions": ["早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌", "早晨祝福、全校晨頌"] },
      { "time": "08:30~10:30", "duration": "120", "sessions": ["主課程", "主課程", "主課程", "主課程", "主課程"] },
      { "time": "10:30~10:50", "duration": "20", "sessions": ["早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲", "早點心時間、自由遊戲"] },
      { "time": "10:50~11:35", "duration": "45", "sessions": ["英文（May）", "英文（May）", "年段任務(黃千瑜)", "語文練習（黃千瑜）", "秋冬:泥塑（張又予）<br>春夏:木工（吳庭豪）"] },
      { "time": "11:45~12:30", "duration": "45", "sessions": ["英文（May）", "英文（May）", "班會（黃千瑜）", "學科輔導（黃千瑜）", ""] },
      { "time": "12:30~13:30", "duration": "60", "sessions": ["午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲", "午餐時間、整潔活動、靜心休息、自由遊戲"] },
      { "time": "13:30~14:15", "duration": "45", "sessions": ["園藝（林孟廷）", "資訊素養（吳俊輝）", "合奏（陳乃欣）", "數學練習（姜怡伶）", "秋冬:手工（楊慧如）<br>春夏:戲劇（董佳琳）"] },
      { "time": "14:25~15:10", "duration": "45", "sessions": ["體育（林孟廷）", "武術（趙奕瑋）", "社團", "秋冬:書法（朱道興）<br>春夏:藝術(林祐竹)", ""] },
      { "time": "15:20~16:05", "duration": "45", "sessions": ["音樂（陳乃欣）", "社會練習（黃千瑜）", "自然練習（劉得光）", "", ""] },
    ]
  }
]
